bpel-service/simple_correlation/src/test/resources/xml/goodbye_request1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.jboss.org/bpel/examples/wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:goodbyeMessage>
         <sessionId>
            <id>1</id>
         </sessionId>
         <parameter>Test</parameter>
      </wsdl:goodbyeMessage>
   </soapenv:Body>
</soapenv:Envelope>